app/controllers/students_controller.rb

  def show
    @student = Student.find(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", nil]]